{"pageProps":{"docs":{"content":"# @web3-wallet/detect-provider\n\n## context\n\nWallet providers are usually injected to the host environment(the web browser window object) wallets(wallet browser extensions or wallet mobile APPs). In order to connect to wallets, dApps need to retrieve the wallet providers from the host environment. This library is here to help detect and retrieve the wallet providers from the host environment. @web3-wallet/detect-provider is designed to be able to detect all kinds of wallet providers from the host environment.\n\n## Synchronous and Asynchronous Injection\n\nProviders could be injected synchronously or asynchronously:\n\n- Synchronously injected providers is available by the time the dApp starts it's execution.\n- Asynchronously injected providers may not become available until a later time in the page lifecycle.\n\nAs a example, the MetaMask extension provider is injected synchronously. But the MetaMask mobile provider is\ninjected asynchronously. To notify dApps of asynchronous injection, MetaMask dispatches the ethereum#initialized\nevent on window immediately after the provider has been set as window.ethereum.\n\nHowever, We can't ensure that all wallet will fire the `ethereum#initialized` event properly when the provider\nis injected asynchronously. To make sure that we are able retrieve the provider correctly, We also need to periodically check/poll for the existence of the provider from the host environment.\n\n## References\n\n- [MetaMask/detect-provider](https://github.com/MetaMask/detect-provider#synchronous-and-asynchronous-injection=)\n","toc":[{"id":"context","indent":1,"content":"context"},{"id":"synchronous-and-asynchronous-injection","indent":1,"content":"Synchronous and Asynchronous Injection"},{"id":"references","indent":1,"content":"References"}]},"route":{"label":"Provider Detection","slug":["provider-detection"],"path":"/home/runner/work/web3-wallet/web3-wallet/packages/detect-provider/README.md"}},"__N_SSG":true}